TE-LIEN/repository_1/console_mode_(since_B010002_err_temp)/ThirdParty/mbedtls-3.1.0/port/nuvoton/m2354_mbedtls_config.h
/**
 * \file config.h
 *
 * \brief Configuration options (set of defines)
 *
 *  This set of compile-time options may be used to enable
 *  or disable features selectively, and reduce the global
 *  memory footprint.
 */
/*
 *  Copyright The Mbed TLS Contributors
 *  SPDX-License-Identifier: Apache-2.0
 *  Copyright 2017, 2021 NXP. Not a Contribution
 *
 *  Licensed under the Apache License, Version 2.0 (the "License"); you may
 *  not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 *  This file is part of mbed TLS (https://tls.mbed.org)
 */

#ifndef KSDK_MBEDTLS_CONFIG_H
#define KSDK_MBEDTLS_CONFIG_H

//#define TEST_SOFTWARE_CRYPT	//for test use


#define TCP_CLIENT_CFG_MBEDTLS_ENABLE	1


#ifndef TEST_SOFTWARE_CRYPT
#define ENABLE_NUVOTON_ECP_ALT
#endif
#define MBEDTLS_ENTROPY_HARDWARE_ALT

	
	//#define FSL_FEATURE_SOC_MMCAU_COUNT 1
	//#define SDK_ALIGN(var, alignbytes) _Pragma("data_alignment=8") var
	//#define SDK_ALIGN(var, alignbytes) __align(alignbytes) var
	#define SDK_ALIGN(var, alignbytes) __attritube__ ((aligned(alignbytes))) var
	
	#define MBEDTLS_NO_PLATFORM_ENTROPY
	
#define AT_NONCACHEABLE_SECTION(var) var
#define AT_NONCACHEABLE_SECTION_ALIGN(var, alignbytes) SDK_ALIGN(var, alignbytes)
#define AT_NONCACHEABLE_SECTION_INIT(var) var
#define AT_NONCACHEABLE_SECTION_ALIGN_INIT(var, alignbytes) SDK_ALIGN(var, alignbytes)

#if !defined(__OPTIMIZE__)	//yushun remove test optimization
#define MBEDTLS_HAVE_ASM	
#define MBEDTLS_AESNI_C
#define MBEDTLS_PADLOCK_C
#endif

#if 0
#include <stdarg.h>
	extern int platform_printf_uninit( const char *format, ... );
	extern int platform_fprintf_uninit( void *stream, const char *format, ... );
	extern int platform_vsnprintf_uninit( char * s, int n, const char * format, va_list arg );
	extern int platform_snprintf_uninit( char * s, int n, const char * format, ... );
	#define MBEDTLS_PLATFORM_NO_STD_FUNCTIONS
	#define MBEDTLS_PLATFORM_PRINTF_MACRO				platform_printf_uninit
	#define MBEDTLS_PLATFORM_SNPRINTF_MACRO			platform_snprintf_uninit
	#define MBEDTLS_PLATFORM_FPRINTF_MACRO			platform_fprintf_uninit
	#define MBEDTLS_PLATFORM_VSNPRINTF_MACRO		platform_vsnprintf_uninit
#endif
	
	//#define MBEDTLS_PLATFORM_PRINTF_ALT
	//#define MBEDTLS_PLATFORM_FPRINTF_ALT
	//#define MBEDTLS_PLATFORM_VSNPRINTF_ALT
	//#define MBEDTLS_PLATFORM_SNPRINTF_ALT

	#define YUSHUN_TEST_NO_RSA	0

	#if !YUSHUN_TEST_NO_RSA
	//#define MBEDTLS_RSA_ALT	//currently Trust M can not use
	#endif
	
	//#define MBEDTLS_SEND_DBG_MSG
	//#define MBEDTLS_DISPLAY_CRYPTO_TIME
	//#define MBEDTLS_DISPLAY_CLIENT_CONNECT
	
#ifdef MBEDTLS_DISPLAY_CRYPTO_TIME
	extern long systemTickGet(void);
#endif
	
	extern void appDbgMsg(char *format, ...);
	#define mbedtlsDbgMsg	appDbgMsg
	
	
//NUVOTON EXAMPLE CONFIG
#ifdef ENABLE_NUVOTON_ECP_ALT
#define MBEDTLS_ECP_ALT
//#define MBEDTLS_RSA_ALT

#if !defined(MBEDTLS_ECP_ALT)

#define MBEDTLS_ECP_INTERNAL_ALT

/* Support for Weierstrass curves with Jacobi representation */
#define MBEDTLS_ECP_ADD_MIXED_ALT
#define MBEDTLS_ECP_DOUBLE_JAC_ALT
#define MBEDTLS_ECP_NORMALIZE_JAC_ALT
#define MBEDTLS_ECP_NORMALIZE_JAC_MANY_ALT
	
/* Support for curves with Montgomery arithmetic */
//#define MBEDTLS_ECP_DOUBLE_ADD_MXZ_ALT
#define MBEDTLS_ECP_RANDOMIZE_MXZ_ALT
#define MBEDTLS_ECP_NORMALIZE_MXZ_ALT
#endif
#endif
//NUVOTON EXAMPLE CONFIG
	
	//nuvoton ECC define start
	//#define MBEDTLS_ECP_ALT
	//#define MBEDTLS_ECDH_GEN_PUBLIC_ALT
	//#define MBEDTLS_ECDH_COMPUTE_SHARED_ALT
	
	//#define MBEDTLS_ECDSA_VERIFY_ALT
	//#define MBEDTLS_ECDSA_SIGN_ALT
	//#define MBEDTLS_ECDSA_GENKEY_ALT
	//try use no TrustM end
	
	//#define MBEDTLS_ECDSA_DETERMINISTIC	//trust-m disable
	//#define MBEDTLS_SSL_CBC_RECORD_SPLITTING

	//disable UDP TLS start
	#define MBEDTLS_SSL_PROTO_DTLS	
	#define MBEDTLS_SSL_DTLS_HELLO_VERIFY
	#define MBEDTLS_SSL_DTLS_ANTI_REPLAY
	#define MBEDTLS_SSL_DTLS_CLIENT_PORT_REUSE
	#define MBEDTLS_SSL_DTLS_BADMAC_LIMIT
	//disable UDP TLS end
	
	//disable SSL SERVER
	//#define MBEDTLS_SSL_SRV_C
	
	
	//#define MBEDTLS_ECDH_GEN_PUBLIC_ALT
	
#if 0
	#define MBEDTLS_ECP_INTERNAL_ALT
	#define MBEDTLS_ECP_ADD_MIXED_ALT
	#define MBEDTLS_ECP_DOUBLE_JAC_ALT
	#define MBEDTLS_ECP_NORMALIZE_JAC_ALT
	#define MBEDTLS_ECP_NORMALIZE_JAC_MANY_ALT
#endif
	
#if !YUSHUN_TEST_NO_RSA
	#define MBEDTLS_KEY_EXCHANGE_RSA_PSK_ENABLED
	#define MBEDTLS_KEY_EXCHANGE_RSA_ENABLED
	#define MBEDTLS_KEY_EXCHANGE_DHE_RSA_ENABLED
	#define MBEDTLS_KEY_EXCHANGE_ECDHE_RSA_ENABLED
	#define MBEDTLS_KEY_EXCHANGE_ECDH_RSA_ENABLED
	#define MBEDTLS_X509_RSASSA_PSS_SUPPORT
	#define MBEDTLS_RSA_C
#endif


//#define MBEDTLS_SSL_PROTO_TLS1	
//#define MBEDTLS_SSL_PROTO_TLS1_1

/* Enable MMCAU use in library if there is MMCAU on chip. */
#if defined(FSL_FEATURE_SOC_MMCAU_COUNT) && (FSL_FEATURE_SOC_MMCAU_COUNT > 0)
  //#include "fsl_mmcau.h"

  //#define MBEDTLS_FREESCALE_MMCAU_MD5    /* Enable use of MMCAU MD5.*/
  #define MBEDTLS_FREESCALE_MMCAU_SHA1   /* Enable use of MMCAU SHA1.*/
  #define MBEDTLS_FREESCALE_MMCAU_SHA256 /* Enable use of MMCAU SHA256.*/
  //#define MBEDTLS_FREESCALE_MMCAU_DES    /* Enable use of MMCAU DES, when LTC is disabled.*/
  #define MBEDTLS_FREESCALE_MMCAU_AES    /* Enable use of MMCAU AES, when LTC is disabled.*/
#endif


#if defined(USE_RTOS) && defined(SDK_OS_FREE_RTOS)
  #define MBEDTLS_FREESCALE_FREERTOS_CALLOC_ALT
#endif

/* Define ALT functions. */
	
	//M480 with DES, M2354 NO DES
  //#define MBEDTLS_DES_ALT
  //#define MBEDTLS_DES3_SETKEY_ENC_ALT
  //#define MBEDTLS_DES3_SETKEY_DEC_ALT
  //#define MBEDTLS_DES3_CRYPT_ECB_ALT

  //#define MBEDTLS_DES_SETKEY_ENC_ALT
  //#define MBEDTLS_DES_SETKEY_DEC_ALT
  //#define MBEDTLS_DES_CRYPT_ECB_ALT

#ifndef TEST_SOFTWARE_CRYPT
  #define MBEDTLS_AES_ALT
  #define MBEDTLS_AES_SETKEY_ENC_ALT
  #define MBEDTLS_AES_SETKEY_DEC_ALT
  #define MBEDTLS_AES_ENCRYPT_ALT
  #define MBEDTLS_AES_DECRYPT_ALT
#endif
	
	//#define MBEDTLS_CIPHER_MODE_OFB	//code not ready temp remove
  
  //#define MBEDTLS_AES_ALT_NO_256	//yushun add for test

#ifndef TEST_SOFTWARE_CRYPT
	#define MBEDTLS_SHA1_ALT
	#define MBEDTLS_SHA256_ALT
	#define MBEDTLS_SHA512_ALT
#endif
	
